app/Validation/Docenterules.php

    public function validateDocente(string $str, string $fields, array $data) {
        $model = new DocenteModel();

        $docente = $model->where('username', $data['username'])->first();
---
SELECT *
FROM `docentes`
WHERE `username` = 'marialopez'
 LIMIT 1