app/Controllers/Admin/AsignaturaController.php

SELECT *
FROM `asignaturas`
ORDER BY `nombre` ASC
SELECT *
FROM `carreras`
ORDER BY `nombre` ASC
---
    public function index()
    {
        $asignaturas = $this->asignaturaModel->orderBy('nombre', 'asc')->findAll();
        $carreraModel = new CarreraModel();

        $data = [
            'asignaturas'   => $asignaturas,
            'carreras'      => $carreraModel->orderBy('nombre', 'asc')->findAll()