app/Controllers/Admin/CarreraController.php

    public function index()
    {
        $carreras = $this->carreraModel->orderBy('nombre', 'asc')->findAll();
        $carreraModel = new CarreraModel();

        $data = [
            'carreras'  => $carreras,
            'carreras'  => $carreraModel->orderBy('nombre', 'asc')->findAll()
---
SELECT *
FROM `carreras`
ORDER BY `nombre` ASC

    public function update($id = null)
    {
        $data = [
            'id'            => $this->request->getVar('id'),
            'nombre'        => $this->request->getVar('nombre'),
            'descripcion'   => $this->request->getVar('descripcion')
        ];

        $this->carreraModel->update($id, $data);
---
UPDATE `carreras` SET `nombre` = 'Licenciatura en Psicología', `descripcion` = NULL, `updated_at` = '2023-11-01 06:24:26'
WHERE `carreras`.`id` IN ('3')

    public function asignarDocentes($carrera)
    {
        $docentes = $this->usuarioModel->where('rol', 'docente')->orderBy('nombre', 'asc')->findAll();
        $carreras = $this->carreraModel->find($carrera);
---
SELECT *
FROM `usuarios`
WHERE `rol` = 'docente'
ORDER BY `nombre` ASC
SELECT *
FROM `carreras`
WHERE `carreras`.`id` = '3'

    public function guardarAsignacion()
    {

        $carreraId = $this->request->getPost('carrera_id');
        $docentesSeleccionados = $this->request->getPost('docentes');

        // Validar datos
        if (empty($docentesSeleccionados)) {
            // Manejar el caso en el que no se hayan seleccionado docentes
            return redirect()->to('carrera/asignar_docentes/' . $carreraId)->with('error', 'Debes seleccionar al menos un docente.');
        }

        // Eliminar asignaciones anteriores para esta carrera
        // $this->docentesCarrerasModel->where('carrera', $carreraId)->delete();

        // Guardar las nuevas asignaciones en la base de datos
        foreach ($docentesSeleccionados as $docenteId) {
            $data = [
                'carrera' => $carreraId,
                'docente' => $docenteId,
            ];

            $this->docentesCarrerasModel->insert($data);
---
INSERT INTO `docentes_carreras` (`carrera`, `docente`, `created_at`, `updated_at`) VALUES ('6', '20', '2023-11-10 05:06:39', '2023-11-10 05:06:39')