app/Controllers/Admin/GrupoController.php

    public function index()
    {
        $grupos = $this->grupoModel->findAll();
---
SELECT *
FROM `grupos`