app/Controllers/Admin/UsuarioController.php

SELECT *
FROM `usuarios`
JOIN `expedientes` ON `usuarios`.`id` = `expedientes`.`docente`
ORDER BY `id` DESC
---
    public function index()
    {
        $usuarios = $this->usuario->orderBy('id', 'desc')->findAll(50);