app/Controllers/Admin/UsuarioController.php

    public function usuariosDocentes()
    {
        $usuariosDocentes = $this->usuario->join('expedientes', 'usuarios.id = expedientes.docente')->where('rol', 'docente')->orderBy('nombre', 'asc')->findAll();
---
SELECT *
FROM `usuarios`
LEFT JOIN `expedientes` ON `usuarios`.`id` = `expedientes`.`docente`
WHERE `rol` = 'docente'
ORDER BY `nombre` ASC