app/Controllers/Docente/ExpedienteController.php

    public function index()
    {
        $this->session = \Config\Services::session();
        $model = new ExpedienteModel();
        $data = [
            'expediente' => $model->where('docente', $this->session->id)->findAll(),
        ];
---
SELECT *
FROM `expedientes`
WHERE `docente` = '2'