app/Controllers/ProgramacionController.php

    public function create()
    {
        $data['carreras'] = $this->carreraModel->findAll();
        $data['asignaturas'] = $this->asignaturaModel->findAll();
        $data['docentes']   = $this->usuarioModel->where('rol', 'docente')->findAll();
        $data['grupos']     = $this->grupoModel->findAll();
---
SELECT *
FROM `grupos`

    public function getDocentesByCarrera($carreraId)
    {
        $docentesCarreraModel = new DocentesCarrerasModel();
        $docentes = $docentesCarreraModel->select('docentes_carreras.id, usuarios.nombre as nombre, usuarios.apaterno as apaterno, usuarios.amaterno as amaterno')
            ->join('usuarios', 'docentes_carreras.docente = usuarios.id')
            ->where('docentes_carreras.carrera', $carreraId)
            ->orderBy('nombre', 'asc')
            ->findAll();
---
SELECT `docentes_carreras`.`id`, `usuarios`.`nombre` as `nombre`, `usuarios`.`apaterno` as `apaterno`, `usuarios`.`amaterno` as `amaterno`
FROM `docentes_carreras`
JOIN `usuarios` ON `docentes_carreras`.`docente` = `usuarios`.`id`
WHERE `docentes_carreras`.`carrera` = '3'
ORDER BY `nombre` ASC