app/Controllers/ProgramacionController.php

    public function create()
    {
        $data['carreras'] = $this->carreraModel->findAll();
        $data['asignaturas'] = $this->asignaturaModel->findAll();
        $data['docentes']   = $this->usuarioModel->where('rol', 'docente')->findAll();
---
SELECT *
FROM `carreras`
SELECT *
FROM `asignaturas`
SELECT *
FROM `usuarios`
WHERE `rol` = 'docente'

    public function getAsignaturasByCarrera($carreraId)
    {
        $asignaturasCarrerasModel = new CarrerasAsignaturasModel();
        $asignaturas = $asignaturasCarrerasModel->select('asignaturas_carreras.id, asignaturas.clave as clave_asignatura, asignaturas.nombre as nombre_asignatura, asignaturas_carreras.comentario')
            ->join('asignaturas', 'asignaturas_carreras.asignatura = asignaturas.id')
            ->where('carrera', $carreraId)
            ->findAll();
---
SELECT `asignaturas_carreras`.`id`, `asignaturas`.`clave` as `clave_asignatura`, `asignaturas`.`nombre` as `nombre_asignatura`, `asignaturas_carreras`.`comentario`
FROM `asignaturas_carreras`
JOIN `asignaturas` ON `asignaturas_carreras`.`asignatura` = `asignaturas`.`id`
WHERE `carrera` = '1'

    public function getDocentesByCarrera($carreraId)
    {
        $docentesCarreraModel = new DocentesCarrerasModel();
        $docentes = $docentesCarreraModel->select('docentes_carreras.id, usuarios.nombre as nombre, usuarios.apaterno as apaterno, usuarios.amaterno as amaterno')
            ->join('usuarios', 'docentes_carreras.docente = usuarios.id')
            ->where('docentes_carreras.carrera', $carreraId)
            ->orderBy('nombre', 'asc')
            ->findAll();
---
SELECT `docentes_carreras`.`id`, `usuarios`.`nombre` as `nombre`, `usuarios`.`apaterno` as `apaterno`, `usuarios`.`amaterno` as `amaterno`
FROM `docentes_carreras`
JOIN `usuarios` ON `docentes_carreras`.`docente` = `usuarios`.`id`
WHERE `docentes_carreras`.`carrera` = '1'
ORDER BY `nombre` ASC