app/Controllers/Coordinador/ProgramacionController.php

    public function create()
    {
        $data['carreras'] = $this->carreraModel->findAll();
        $data['asignaturas'] = $this->asignaturaModel->findAll();
        $data['docentes']   = $this->usuarioModel->where('rol', 'docente')->findAll();
        $data['grupos']     = $this->grupoModel->findAll();
---
SELECT *
FROM `carreras`
SELECT *
FROM `asignaturas`
SELECT *
FROM `usuarios`
WHERE `rol` = 'docente'
SELECT *
FROM `grupos`